export default [
    {
        "id": 2,
        "name": "东城区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 20,
        "name": "西城区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 36,
        "name": "朝阳区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 80,
        "name": "丰台区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 107,
        "name": "石景山区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 117,
        "name": "海淀区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 147,
        "name": "门头沟区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 161,
        "name": "房山区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 190,
        "name": "通州区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 213,
        "name": "顺义区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 239,
        "name": "昌平区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 262,
        "name": "大兴区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 289,
        "name": "怀柔区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 307,
        "name": "平谷区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 326,
        "name": "密云区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 348,
        "name": "延庆区",
        "pid": 1,
        "level": 2
    },
    {
        "id": 368,
        "name": "和平区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 375,
        "name": "河东区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 389,
        "name": "河西区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 404,
        "name": "南开区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 417,
        "name": "河北区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 428,
        "name": "红桥区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 438,
        "name": "东丽区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 458,
        "name": "西青区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 474,
        "name": "津南区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 490,
        "name": "北辰区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 515,
        "name": "武清区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 553,
        "name": "宝坻区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 580,
        "name": "滨海新区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 607,
        "name": "宁河区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 630,
        "name": "静海区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 654,
        "name": "蓟州区",
        "pid": 367,
        "level": 2
    },
    {
        "id": 684,
        "name": "石家庄市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 989,
        "name": "唐山市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 1259,
        "name": "秦皇岛市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 1371,
        "name": "邯郸市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 1638,
        "name": "邢台市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 1859,
        "name": "保定市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 2245,
        "name": "张家口市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 2511,
        "name": "承德市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 2743,
        "name": "沧州市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 2972,
        "name": "廊坊市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 3107,
        "name": "衡水市",
        "pid": 683,
        "level": 2
    },
    {
        "id": 3251,
        "name": "太原市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 3371,
        "name": "大同市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 3510,
        "name": "阳泉市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 3559,
        "name": "长治市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 3721,
        "name": "晋城市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 3805,
        "name": "朔州市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 3885,
        "name": "晋中市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 4027,
        "name": "运城市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 4202,
        "name": "忻州市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 4391,
        "name": "临汾市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 4567,
        "name": "吕梁市",
        "pid": 3250,
        "level": 2
    },
    {
        "id": 4736,
        "name": "呼和浩特市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 4846,
        "name": "包头市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 4948,
        "name": "乌海市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 4974,
        "name": "赤峰市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5184,
        "name": "通辽市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5337,
        "name": "鄂尔多斯市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5435,
        "name": "呼伦贝尔市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5608,
        "name": "巴彦淖尔市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5705,
        "name": "乌兰察布市",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5827,
        "name": "兴安盟",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 5924,
        "name": "锡林郭勒盟",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 6037,
        "name": "阿拉善盟",
        "pid": 4735,
        "level": 2
    },
    {
        "id": 6082,
        "name": "沈阳市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6286,
        "name": "大连市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6449,
        "name": "鞍山市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6553,
        "name": "抚顺市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6633,
        "name": "本溪市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6689,
        "name": "丹东市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6785,
        "name": "锦州市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6897,
        "name": "营口市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 6974,
        "name": "阜新市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 7065,
        "name": "辽阳市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 7123,
        "name": "盘锦市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 7178,
        "name": "铁岭市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 7292,
        "name": "朝阳市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 7463,
        "name": "葫芦岛市",
        "pid": 6081,
        "level": 2
    },
    {
        "id": 7603,
        "name": "长春市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 7850,
        "name": "吉林市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8013,
        "name": "四平市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8098,
        "name": "辽源市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8151,
        "name": "通化市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8268,
        "name": "白山市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8342,
        "name": "松原市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8496,
        "name": "白城市",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8629,
        "name": "延边朝鲜族自治州",
        "pid": 7602,
        "level": 2
    },
    {
        "id": 8757,
        "name": "哈尔滨市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9104,
        "name": "齐齐哈尔市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9330,
        "name": "鸡西市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9435,
        "name": "鹤岗市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9513,
        "name": "双鸭山市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9632,
        "name": "大庆市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9761,
        "name": "伊春市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9822,
        "name": "佳木斯市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 9971,
        "name": "七台河市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 10020,
        "name": "牡丹江市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 10123,
        "name": "黑河市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 10290,
        "name": "绥化市",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 10548,
        "name": "大兴安岭地区",
        "pid": 8756,
        "level": 2
    },
    {
        "id": 10600,
        "name": "黄浦区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10611,
        "name": "徐汇区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10626,
        "name": "长宁区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10637,
        "name": "静安区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10652,
        "name": "普陀区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10663,
        "name": "虹口区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10672,
        "name": "杨浦区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10685,
        "name": "闵行区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10700,
        "name": "宝山区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10714,
        "name": "嘉定区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10727,
        "name": "浦东新区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10770,
        "name": "金山区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10782,
        "name": "松江区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10803,
        "name": "青浦区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10815,
        "name": "奉贤区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10828,
        "name": "崇明区",
        "pid": 10599,
        "level": 2
    },
    {
        "id": 10851,
        "name": "南京市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11003,
        "name": "无锡市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11099,
        "name": "徐州市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11297,
        "name": "常州市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11371,
        "name": "苏州市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11500,
        "name": "南通市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11645,
        "name": "连云港市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11762,
        "name": "淮安市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 11884,
        "name": "盐城市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 12049,
        "name": "扬州市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 12155,
        "name": "镇江市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 12223,
        "name": "泰州市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 12339,
        "name": "宿迁市",
        "pid": 10850,
        "level": 2
    },
    {
        "id": 12456,
        "name": "杭州市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 12666,
        "name": "宁波市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 12839,
        "name": "温州市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13043,
        "name": "嘉兴市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13123,
        "name": "湖州市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13201,
        "name": "绍兴市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13311,
        "name": "金华市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13467,
        "name": "衢州市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13574,
        "name": "舟山市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13615,
        "name": "台州市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13761,
        "name": "丽水市",
        "pid": 12455,
        "level": 2
    },
    {
        "id": 13945,
        "name": "合肥市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14118,
        "name": "芜湖市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14207,
        "name": "蚌埠市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14304,
        "name": "淮南市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14407,
        "name": "马鞍山市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14473,
        "name": "淮北市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14515,
        "name": "铜陵市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14580,
        "name": "安庆市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14760,
        "name": "黄山市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 14877,
        "name": "滁州市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15012,
        "name": "阜阳市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15193,
        "name": "宿州市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15323,
        "name": "六安市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15477,
        "name": "亳州市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15578,
        "name": "池州市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15649,
        "name": "宣城市",
        "pid": 13944,
        "level": 2
    },
    {
        "id": 15766,
        "name": "福州市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 15966,
        "name": "厦门市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16027,
        "name": "莆田市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16090,
        "name": "三明市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16249,
        "name": "泉州市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16437,
        "name": "漳州市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16595,
        "name": "南平市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16748,
        "name": "龙岩市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 16889,
        "name": "宁德市",
        "pid": 15765,
        "level": 2
    },
    {
        "id": 17030,
        "name": "南昌市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17179,
        "name": "景德镇市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17243,
        "name": "萍乡市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17307,
        "name": "九江市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17548,
        "name": "新余市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17585,
        "name": "鹰潭市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17648,
        "name": "赣州市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 17977,
        "name": "吉安市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 18243,
        "name": "宜春市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 18473,
        "name": "抚州市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 18666,
        "name": "上饶市",
        "pid": 17029,
        "level": 2
    },
    {
        "id": 18909,
        "name": "济南市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19087,
        "name": "青岛市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19239,
        "name": "淄博市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19336,
        "name": "枣庄市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19409,
        "name": "东营市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19469,
        "name": "烟台市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19642,
        "name": "潍坊市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19778,
        "name": "济宁市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 19949,
        "name": "泰安市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20044,
        "name": "威海市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20125,
        "name": "日照市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20187,
        "name": "临沂市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20357,
        "name": "德州市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20505,
        "name": "聊城市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20650,
        "name": "滨州市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20750,
        "name": "菏泽市",
        "pid": 18908,
        "level": 2
    },
    {
        "id": 20930,
        "name": "郑州市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 21154,
        "name": "开封市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 21288,
        "name": "洛阳市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 21498,
        "name": "平顶山市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 21659,
        "name": "安阳市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 21807,
        "name": "鹤壁市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 21862,
        "name": "新乡市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22048,
        "name": "焦作市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22172,
        "name": "濮阳市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22270,
        "name": "许昌市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22383,
        "name": "漯河市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22448,
        "name": "三门峡市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22537,
        "name": "南阳市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 22809,
        "name": "商丘市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 23020,
        "name": "信阳市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 23256,
        "name": "周口市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 23477,
        "name": "驻马店市",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 23697,
        "name": "省直辖县级行政区划",
        "pid": 20929,
        "level": 2
    },
    {
        "id": 23715,
        "name": "武汉市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 23922,
        "name": "黄石市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 23986,
        "name": "十堰市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24124,
        "name": "宜昌市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24251,
        "name": "襄阳市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24391,
        "name": "鄂州市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24423,
        "name": "荆门市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24513,
        "name": "孝感市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24649,
        "name": "荆州市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24788,
        "name": "黄冈市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 24965,
        "name": "咸宁市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 25061,
        "name": "随州市",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 25116,
        "name": "恩施土家族苗族自治州",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 25219,
        "name": "省直辖县级行政区划",
        "pid": 23714,
        "level": 2
    },
    {
        "id": 25310,
        "name": "长沙市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 25492,
        "name": "株洲市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 25614,
        "name": "湘潭市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 25693,
        "name": "衡阳市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 25899,
        "name": "邵阳市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 26118,
        "name": "岳阳市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 26267,
        "name": "常德市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 26456,
        "name": "张家界市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 26535,
        "name": "益阳市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 26642,
        "name": "郴州市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 26816,
        "name": "永州市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 27025,
        "name": "怀化市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 27246,
        "name": "娄底市",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 27341,
        "name": "湘西土家族苗族自治州",
        "pid": 25309,
        "level": 2
    },
    {
        "id": 27467,
        "name": "广州市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 27657,
        "name": "韶关市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 27780,
        "name": "深圳市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 27869,
        "name": "珠海市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 27904,
        "name": "汕头市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 27979,
        "name": "佛山市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28026,
        "name": "江门市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28116,
        "name": "湛江市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28251,
        "name": "茂名市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28384,
        "name": "肇庆市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28499,
        "name": "惠州市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28589,
        "name": "梅州市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28715,
        "name": "汕尾市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28783,
        "name": "河源市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28891,
        "name": "阳江市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 28959,
        "name": "清远市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 29060,
        "name": "东莞市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 29097,
        "name": "中山市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 29121,
        "name": "潮州市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 29176,
        "name": "揭阳市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 29290,
        "name": "云浮市",
        "pid": 27466,
        "level": 2
    },
    {
        "id": 29368,
        "name": "南宁市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 29519,
        "name": "柳州市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 29648,
        "name": "桂林市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 29814,
        "name": "梧州市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 29888,
        "name": "北海市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 29923,
        "name": "防城港市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 29959,
        "name": "钦州市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30035,
        "name": "贵港市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30115,
        "name": "玉林市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30233,
        "name": "百色市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30383,
        "name": "贺州市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30450,
        "name": "河池市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30603,
        "name": "来宾市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30681,
        "name": "崇左市",
        "pid": 29367,
        "level": 2
    },
    {
        "id": 30778,
        "name": "海口市",
        "pid": 30777,
        "level": 2
    },
    {
        "id": 30829,
        "name": "三亚市",
        "pid": 30777,
        "level": 2
    },
    {
        "id": 30838,
        "name": "三沙市",
        "pid": 30777,
        "level": 2
    },
    {
        "id": 30847,
        "name": "儋州市",
        "pid": 30777,
        "level": 2
    },
    {
        "id": 30866,
        "name": "省直辖县级行政区划",
        "pid": 30777,
        "level": 2
    },
    {
        "id": 31053,
        "name": "市辖区",
        "pid": 31052,
        "level": 2
    },
    {
        "id": 31730,
        "name": "县",
        "pid": 31052,
        "level": 2
    },
    {
        "id": 32125,
        "name": "成都市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 32407,
        "name": "自贡市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 32504,
        "name": "攀枝花市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 32559,
        "name": "泸州市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 32693,
        "name": "德阳市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 32784,
        "name": "绵阳市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 32961,
        "name": "广元市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33115,
        "name": "遂宁市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33216,
        "name": "内江市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33305,
        "name": "乐山市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33449,
        "name": "南充市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33701,
        "name": "眉山市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33788,
        "name": "宜宾市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 33935,
        "name": "广安市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 34066,
        "name": "达州市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 34274,
        "name": "雅安市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 34379,
        "name": "巴中市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 34524,
        "name": "资阳市",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 34618,
        "name": "阿坝藏族羌族自治州",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 34810,
        "name": "甘孜藏族自治州",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 35118,
        "name": "凉山彝族自治州",
        "pid": 32124,
        "level": 2
    },
    {
        "id": 35441,
        "name": "贵阳市",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 35598,
        "name": "六盘水市",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 35695,
        "name": "遵义市",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 35964,
        "name": "安顺市",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 36063,
        "name": "毕节市",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 36351,
        "name": "铜仁市",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 36543,
        "name": "黔西南布依族苗族自治州",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 36692,
        "name": "黔东南苗族侗族自治州",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 36926,
        "name": "黔南布依族苗族自治州",
        "pid": 35440,
        "level": 2
    },
    {
        "id": 37049,
        "name": "昆明市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37214,
        "name": "曲靖市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37361,
        "name": "玉溪市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37447,
        "name": "保山市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37529,
        "name": "昭通市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37691,
        "name": "丽江市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37763,
        "name": "普洱市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37877,
        "name": "临沧市",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 37970,
        "name": "楚雄彝族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38084,
        "name": "红河哈尼族彝族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38237,
        "name": "文山壮族苗族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38352,
        "name": "西双版纳傣族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38398,
        "name": "大理白族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38523,
        "name": "德宏傣族景颇族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38585,
        "name": "怒江傈僳族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38621,
        "name": "迪庆藏族自治州",
        "pid": 37048,
        "level": 2
    },
    {
        "id": 38656,
        "name": "拉萨市",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 38738,
        "name": "日喀则市",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 38963,
        "name": "昌都市",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 39113,
        "name": "林芝市",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 39177,
        "name": "山南市",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 39275,
        "name": "那曲市",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 39401,
        "name": "阿里地区",
        "pid": 38655,
        "level": 2
    },
    {
        "id": 39447,
        "name": "西安市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 39633,
        "name": "铜川市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 39676,
        "name": "宝鸡市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 39809,
        "name": "咸阳市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 39966,
        "name": "渭南市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 40114,
        "name": "延安市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 40245,
        "name": "汉中市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 40434,
        "name": "榆林市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 40631,
        "name": "安康市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 40781,
        "name": "商洛市",
        "pid": 39446,
        "level": 2
    },
    {
        "id": 40900,
        "name": "兰州市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41026,
        "name": "嘉峪关市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41032,
        "name": "金昌市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41053,
        "name": "白银市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41137,
        "name": "天水市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41275,
        "name": "武威市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41388,
        "name": "张掖市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41473,
        "name": "平凉市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41594,
        "name": "酒泉市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41686,
        "name": "庆阳市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41814,
        "name": "定西市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 41944,
        "name": "陇南市",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 42153,
        "name": "临夏回族自治州",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 42293,
        "name": "甘南藏族自治州",
        "pid": 40899,
        "level": 2
    },
    {
        "id": 42405,
        "name": "西宁市",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42493,
        "name": "海东市",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42598,
        "name": "海北藏族自治州",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42635,
        "name": "黄南藏族自治州",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42673,
        "name": "海南藏族自治州",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42719,
        "name": "果洛藏族自治州",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42770,
        "name": "玉树藏族自治州",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42826,
        "name": "海西蒙古族藏族自治州",
        "pid": 42404,
        "level": 2
    },
    {
        "id": 42881,
        "name": "银川市",
        "pid": 42880,
        "level": 2
    },
    {
        "id": 42950,
        "name": "石嘴山市",
        "pid": 42880,
        "level": 2
    },
    {
        "id": 42990,
        "name": "吴忠市",
        "pid": 42880,
        "level": 2
    },
    {
        "id": 43046,
        "name": "固原市",
        "pid": 42880,
        "level": 2
    },
    {
        "id": 43117,
        "name": "中卫市",
        "pid": 42880,
        "level": 2
    },
    {
        "id": 43168,
        "name": "乌鲁木齐市",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43307,
        "name": "克拉玛依市",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43331,
        "name": "吐鲁番市",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43370,
        "name": "哈密市",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43432,
        "name": "昌吉回族自治州",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43546,
        "name": "博尔塔拉蒙古自治州",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43585,
        "name": "巴音郭楞蒙古自治州",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43704,
        "name": "阿克苏地区",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43828,
        "name": "克孜勒苏柯尔克孜自治州",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 43879,
        "name": "喀什地区",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 44101,
        "name": "和田地区",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 44216,
        "name": "伊犁哈萨克自治州",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 44378,
        "name": "塔城地区",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 44506,
        "name": "阿勒泰地区",
        "pid": 43167,
        "level": 2
    },
    {
        "id": 44584,
        "name": "自治区直辖县级行政区划",
        "pid": 43167,
        "level": 2
    }
]